Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_SwiftProgrammingLanguage_ePub5.2/Swift_ePub_SPL-omegat.tmx
Source language: en_us
Languages: ja

source: A sign bit of 0 means positive, and a sign bit of 1 means negative.
ja: 0の符号ビットは正を意味します、そして、1の符号ビットは負であることを意味します。

source: A similar principle is used to check for Song instances, and to print an appropriate description (including artist name) whenever a Song is found in the library.
ja: 類似した原則が使用されて、Songインスタンスか確認して、そしてSongがlibraryで見つけられるときはいつでも、適切な説明（artist名を含む）を出力します。

source: A simple conditional compilation block has the following form:
ja: 単純な条件コンパイルブロックは、以下の形式を持ちます：

source: A simple way to remember this is:
ja: これを覚えている単純な方法は、以下の通りです：

source: A single expression inside parentheses is a parenthesized expression.
ja: 丸括弧で囲まれたただ１つだけの式は、括弧で囲まれた式です。

source: A single-line string literal is surrounded by double quotation marks and has the following form:
ja: 単一行の文字列リテラルは、二重引用符によって囲まれて、以下の形式を持ちます：

source: A speed of 35.0 produces a gear of 4:
ja: 速度35.0はギア4を示します：

source: A stack is a useful collection model whenever you need a strict “last in, first out” approach to managing a collection.
ja: スタックは、厳格に「最後に入れたものが、最初に取り出される」取り組みをコレクションを管理するために必要とするときはいつでも、役に立つコレクション・モデルです。

source: A stack is an ordered set of values, similar to an array, but with a more restricted set of operations than Swift’s Array type.
ja: スタックは、順序付けられたいくつかの値の集合であり、配列に似ています、しかしスウィフトのArray型より制限された操作具合を持つものです。

source: A stack, however, allows new items to be appended only to the end of the collection (known as pushing a new value on to the stack).
ja: スタックは、しかし、新しい項目をコレクション終わりにのみ追加されることが許されます（新しい値をスタックにプッシュするとして知られます）。

source: A status code of 404 Not Found is returned if you request a webpage that doesn’t exist.
ja: 状態コード404 Not Foundは、あなたが存在しないウェブ・ページを要請するならば返されます。

source: A stored variable or property declared with observers has the following form:
ja: オブザーバーとともに宣言される格納変数やプロパティは、以下の形式を持ちます：

source: A string delimited by extended delimiters has the following forms:
ja: 拡張区切り記号によって区切られた文字列は、以下の形式を持ちます：

source: A string delimited by extended delimiters is a sequence of characters surrounded by quotation marks and a balanced set of one or more number signs (#).
ja: 拡張区切り記号によって区切られる文字列は、引用符そして均衡のとれたひとまとめの１つ以上のシャープ記号（#）によって囲まれる一連の文字です。

source: A string literal is a sequence of characters surrounded by double quotation marks (").
ja: 文字列リテラルは、二重引用符（"）によって囲まれた一連の文字です。

source: A string literal is a sequence of characters surrounded by quotation marks.
ja: 文字列リテラルは、引用符によって囲まれた一連の文字です。

source: A strong reference cycle can also occur if you assign a closure to a property of a class instance, and the body of that closure captures the instance.
ja: 強い参照循環はまた、あなたがあるクロージャをクラスインスタンスのプロパティに代入して、そのクロージャの本文がそのインスタンスを捕獲するならば、起こることができます。

source: A strong reference cycle is created between the two.
ja: 強い参照循環は、２つ作られます。

source: A structure or class marked usableFromInline can use only types that are public or usableFromInline for its properties.
ja: usableFromInlineで印される構造体またはクラスは、それのプロパティに対してパブリックまたはusableFromInlineである型のみに使用できます。

source: A subclass can implement a superclass designated initializer as a subclass convenience initializer as part of satisfying rule 2.
ja: サブクラスは、規則２を満たすことの一部として、スーパークラスの指定イニシャライザをサブクラスの便宜イニシャライザとして実装することができます。

source: A subclass can provide its own custom implementation of an instance method, type method, instance property, type property, or subscript that it would otherwise inherit from a superclass.
ja: サブクラスは、それ独自のあつらえの実装のインスタンスメソッド、型メソッド、インスタンスプロパティ、型プロパティ、または添え字を提供することができます、それらはそれがそうしなければスーパークラスから継承するものです。

source: A subclass can’t have a higher access level than its superclass—for example, you can’t write a public subclass of an internal superclass.
ja: サブクラスには、そのスーパークラスより高いアクセス水準があることができません ― 例えば、あなたは内部のスーパークラスに属する公開のサブクラスを書くことができません。

source: A subclass inherits its superclass’s deinitializer, which is implicitly called just before the subclass object is deallocated.
ja: サブクラスはそのスーパークラスのデイニシャライザを継承します、それは、サブクラスオブジェクトが割り当て解除される直前に、暗黙のうちに呼ばれます。

source: A subclass’s implementation of that initializer must also be marked with the required declaration modifier.
ja: そのイニシャライザのサブクラスでの実装は、また、required宣言修飾子で印されなければなりません。

source: A subscript parameter can have a default value, using the syntax described in Special Kinds of Parameters.
ja: 添え字バラメータは省略時の値を持つことができます、特別な種類のパラメータで記述される構文を使います。

source: A switch statement over a frozen enumeration doesn’t require a default case, as discussed in Switching Over Future Enumeration Cases.
ja: 凍結列挙に対するスイッチ文は、defaultケース節を必要しません、未来列挙ケース節に対してスイッチするで議論されるように。

source: A target written in Swift 5.2 can depend on a target that’s written in Swift 4.2 or Swift 4, and vice versa.
ja: Swift 5.2で記述されるターゲットは、Swift 4.2またはSwift 4で記述されるターゲットを頼りにできます、そして逆も同じです。

source: A throwing function propagates errors that are thrown inside of it to the scope from which it’s called.
ja: スロー関数は、それの内部でスローされるエラーを、そこからそれが呼び出されるスコープへと伝えます。

source: A throwing method can’t override a nonthrowing method, and a throwing method can’t satisfy a protocol requirement for a nonthrowing method.
ja: スローメソッドは、非スローメソッドをオーバーライドすることができません、そしてスローメソッドは、非スローメソッド用のプロトコル要件を満たすことができません。

source: A throwing method can’t override a rethrowing method, and a throwing method can’t satisfy a protocol requirement for a rethrowing method.
ja: スローメソッドは、再スローメソッドをオーバーライドできません、そしてスローメソッドは再スローメソッド用のプロトコル要件を満たすことができません。

source: A token consists of an identifier, keyword, punctuation, literal, or operator.
ja: あるトークンは１つの識別子、キーワード、句読点、リテラル、または演算子からなります。

source: A trailing closure is written after the function call’s parentheses, even though it is still an argument to the function.
ja: 後付クロージャは、関数呼び出しの丸括弧の後に書かれます、それでもそれはまだその関数に対する引数であるけれども。

source: A tuple expression can contain zero expressions, or it can contain two or more expressions.
ja: タプル式はゼロ個の式を含むことができます、またはそれは２つまたはそれ以上の式を含むことができます。

source: A tuple type’s access level is determined automatically from the types that make up the tuple type, and can’t be specified explicitly.
ja: あるタプル型のアクセス水準は、そのタプル型を作り上げる型から自動的に決定されます、したがって明示的に指定されることはできません。

source: A type alias can forward an existing type’s generic parameters by omitting all generic parameters from the declaration.
ja: 型エイリアスは、既存の型の持つ総称体パラメータを、全ての総称体パラメータを宣言から省略することによって、転送できます。

source: A type alias can have an access level less than or equal to the access level of the type it aliases.
ja: 型エイリアスは、それがエイリアスする型のアクセス水準と同等またはそれより下のアクセス水準を持つことができます。

source: A type alias declaration can use generic parameters to give a name to an existing generic type.
ja: 型エイリアス宣言は、総称体パラメータを使ってある名前を既存の総称体型に与えることができます。

source: A type alias whose underlying type is a protocol composition type, a protocol, or a class.
ja: それの基礎をなす型がプロトコル合成型、プロトコル、またはクラスである型エイリアス。

source: A type can conform to a protocol with a lower access level than the type itself.
ja: ある型は、その型自体よりも低いアクセス水準を持つプロトコルに準拠することができます。

source: A type inheritance clause begins with a colon (:), followed by a list of type identifiers.
ja: 型継承節はコロン（:）で始まり、型識別子のリストが続きます。

source: A type inheritance clause in an enumeration definition can be either a list of protocols, or in the case of an enumeration that assigns raw values to its cases, a single, named type that specifies the type of those raw values.
ja: 列挙定義における型継承節は、プロトコルのリスト、または生の値をそれのケース節に割り当てる列挙のケース節においては、それらの生の値を指定する単一の名前付き型、このどちらかであることができます。

source: A type method can call another type method with the other method’s name, without needing to prefix it with the type name.
ja: ある型メソッドは、別の型メソッドを他のメソッドの名前を使って呼ぶことができます、その型名をそれの前に置く必要なしに。

source: A type must be hashable in order to be stored in a set—that is, the type must provide a way to compute a hash value for itself.
ja: ある型は、集合のキー型として使われるためにハッシュ化される必要があります ― すなわち、その型はそれ自身でハッシュ値を計算するためのある方法を提供しなければなりません。

source: A type safe language encourages you to be clear about the types of values your code can work with.
ja: 型安全な言語は、あなたのコードが扱うことができる値の型について、あなたが確信を持つように促します。

source: A value can be used as an instance of the opaque type only if it’s an instance of a type that conforms to the listed protocol or protocol composition, or inherits from the listed class.
ja: 値は、不透明型のインスタンスとして使われることが、それが、そのリストされたプロトコルまたはプロトコル合成に準拠する、またはリストされたクラスから継承するある型のインスタンスである場合にのみ、可能です。

source: A value of true in the array represents a black square and a value of false represents a white square.
ja: この配列の中のtrueの値は黒の正方形を表します、そしてfalseの値は白い正方形を表します。

source: A variadic parameter is treated as an array that contains elements of the base type name.
ja: 可変長パラメータは、基本の型の名前の要素たちが入っている配列とみなされます。

source: A wrapper that needs to expose more information can return an instance of some other data type, or it can return self to expose the instance of the wrapper as its projected value.
ja: さらに情報を露出する必要があるラッパーは、何らかの他のデータ型のインスタンスを返せます、またはそれは、selfを返すことでラッパーのインスタンスをそれの予測値として露出できます。

source: ARC automatically frees up the memory used by class instances when those instances are no longer needed.
ja: ARCはクラスインスタンスによって使われるメモリを、それらのインスタンスがもはや必要でないとき、自動的に自由にします。

source: ARC does not deallocate the Person instance until the third and final strong reference is broken, at which point it’s clear that you are no longer using the Person instance:
ja: ARCは、Personインスタンスの割り当て解除を３番目で最後に残ったの強い参照が壊れるまで行いません、その時点では、あなたがもはやPersonインスタンスを使っていないことは明白です：

source: ARC in Action
ja: ARCの動作

source: ARC will not deallocate an instance as long as at least one active reference to that instance still exists.
ja: ARCは、そのインスタンスへの少なくとも１つの活発な参照がまだ存在する限り、インスタンスの割り当て解除をしません。

source: About Swift
ja: スウィフトについて

source: About the Language Reference
ja: 言語リファレンスについて

source: Abstract concepts like Hashable characterize types in terms of their conceptual characteristics, rather than their concrete type.
ja: Hashableのような抽象的な概念たちは、それらの概念上の特徴の観点から型を特徴づけます、その具象型そのものではなく。

source: Access Control
ja: アクセス制御

source: Access Control Levels
ja: アクセス制御水準

source: Access Control Syntax
ja: アクセス制御構文

source: Access Levels
ja: アクセス水準

source: Access Levels for Frameworks
ja: フレームワークのためのアクセス水準

source: Access Levels for Single-Target Apps
ja: 単一ターゲットアプリのためのアクセス水準

source: Access Levels for Unit Test Targets
ja: ユニットテストターゲットのためのアクセス水準

source: Access control is discussed in detail in Access Control.
ja: アクセス制御は、アクセス制御で詳細に議論されます。

source: Access levels in Swift follow an overall guiding principle: No entity can be defined in terms of another entity that has a lower (more restrictive) access level.
ja: スウィフトの中のアクセス水準は、以下の全体的な原理指針に従います：実在は、より低い（制限のより多い）アクセス水準をもつ別の実在の観点から定義されることができない。

source: Access properties of a class instance with dot (.) syntax, as described in Accessing Properties.
ja: クラスインスタンスのプロパティにドット（.）構文でアクセスしてください、プロパティにアクセスするで記述されるように。

source: Access to memory happens in your code when you do things like set the value of a variable or pass an argument to a function.
ja: メモリへのアクセスは、あなたが変数の値を設定するまたは関数に引数を渡すといったような事を行う時にあなたのコードで起こります。

source: Access to that member is never inlined or devirtualized by the compiler.
ja: そのメンパーに対するアクセスは、決してコンパイラによってインラインまたはデバーチャライズされません。

source: Accessing Enumeration Cases
ja: 列挙ケース節にアクセスする

source: Accessing Properties
ja: プロパティにアクセスする

source: Accessing Properties Through Optional Chaining
ja: オプショナル連鎖を通してプロパティにアクセスする

source: Accessing Subscripts Through Optional Chaining
ja: オプショナル連鎖を通して添え字にアクセスする

source: Accessing Subscripts of Optional Type
ja: オプショナル型の添え字にアクセスする

source: Accessing Superclass Methods, Properties, and Subscripts
ja: スーパークラスメソッド、プロパティ、そして添え字へのアクセス

source: Accessing and Modifying a Dictionary
ja: 辞書へのアクセスと変更

source: Accessing and Modifying a Set
ja: 集合へのアクセスと変更

source: Accessing and Modifying a String
ja: 文字列へのアクセスと修正

source: Accessing and Modifying an Array
ja: 配列へのアクセスと変更

source: Accessing the original is a simultaneous access of the value, which violates Swift’s memory exclusivity guarantee.
ja: 元のものにアクセスすることは、その値に対する同時的なアクセスです、それはスウィフトのメモリ排他保証を破ります。

source: Add a color() method to Suit that returns “black” for spades and clubs, and returns “red” for hearts and diamonds.
ja: color()メソッドをSuitに加えてください、それはスペードとクラブのために「黒」を、そしてハートとダイヤのために「赤」を返すものです。

source: Add a constant property with let, and add another method that takes an argument.
ja: 定数プロパティをletを使って１つ加えてください、そして１つの引数をとる別のメソッドを加えてください。

source: Add a parameter to include today’s lunch special in the greeting.
ja: 今日のスペシャル・ランチをこの挨拶に含めるために、パラメータをひとつ加えてください。

source: Add a third case to ServerResponse and to the switch.
ja: 第３の場合をServerResponseに、そしてスイッチに加えてください。

source: Add an else clause that sets a different greeting if optionalName is nil.
ja: optionalNameがnilならば異なる挨拶を設定するelse節を加えてください。

source: Add another requirement to ExampleProtocol.
ja: 別の要件をExampleProtocolに加えてください。

source: Add another variable to keep track of which kind of number was the largest, as well as what that largest number was.
ja: 最も大きい数が何であったかだけでなく、どの種類の数が最も大きいものであったかについて情報を把握するために、もう１つの変数を加えてください。

source: Add code to throw an error inside the do block.
ja: コードを加えてエラーをdoブロック内部でスローしてください。

source: Add computed instance properties and computed type properties
ja: 計算インスタンスプロパティと計算型プロパティを加える

source: Added macCatalyst to the list of target environments in Conditional Compilation Block.
ja: macCatalystをターゲット環境のリストに加えました、条件コンパイルブロックにおいて。

source: Added a description of Failable Initializer Requirements for protocols.
ja: プロパティのための失敗できるイニシャライザ要件の説明を加えました。

source: Added a full guide to Failable Initializers.
ja: 完全なガイドを失敗できるイニシャライザに加えました。

source: Added a new chapter about Access Control.
ja: 新しい章をアクセス制御について加えました。

source: Added a new guide section about String Indices.
ja: 文字列インデックスについての新しいガイド節を加えました。

source: Added a new reference section about Failable Initializers, which can trigger initialization failure.
ja: 新しいリファレンス節を失敗できるイニシャライザについて加えました、それは初期化失敗を起こすことができます。

source: Added a new section about Accessing Subscripts of Optional Type through optional chaining.
ja: オプショナル連鎖を通してオプショナル型の添え字にアクセスすることについての新しい節を加えました。

source: Added a new section about Class-Only Protocols.
ja: クラス専用プロトコルについての新しい節を加えました。

source: Added a new section about Dictionary Type Shorthand Syntax, which is written as [KeyType: ValueType].
ja: 辞書型の略記構文についての新しい節を加えました、それは[KeyType: ValueType]のように書かれます。

source: Added a new section about Hash Values for Set Types.
ja: Set型のためのハッシュ値についての新しい節を加えました。

source: Added a new section about Initializer Parameters Without Argument Labels.
ja: 引数ラベルなしのイニシャライザ・パラメーターについての新しい節を加えました。

source: Added a new section about Initializer Requirements in protocols.
ja: プロトコルにイニシャライザ要件についての新しい節を加えました。

source: Added a new section about Optional Tuple Return Types.
ja: オプショナルタプルの戻り型についての新しい節を加えました。

source: Added a new section about Required Initializers.
ja: 必須イニシャライザについての新しい節を加えました。

source: Added a note about the order in which Prefix and Postfix Operators are applied when both a prefix and a postfix operator are applied to the same operand.
ja: 接頭辞および接尾辞演算子の両方が同じ演算数に適用される時に、接頭辞および接尾辞演算子が適用される順番についての注記を加えました。

source: Added a note that the start value a for the Range Operators a...b and a..<b must not be greater than the end value b.
ja: 開始値aは範囲演算子のa...bとa..<bに対して、終了値bより大きくてはならないことの注意を加えました。

source: Added a note to the Access Levels section with information about the scope of private access.
ja: 節アクセス水準にprivateアクセスのスコープについての情報の注意書きを加えた。

source: Added a note to the Debugging with Assertions section about when user-defined assertions are disabled.
ja: 表明を使ってデバッグする節に、ユーザ定義の表明が使用不能にされた時についての注を加えた。

source: Added a note to the Handling Errors section about the performance of executing a throw statement.
ja: エラーを処理する節にthrow文の実行性能について注意を追加した。

source: Added a note to the Metatype Type section about constructing class instances from metatype values.
ja: メタタイプ値からクラスインスタンスを構成することについての注をメタタイプ型節に加えた。

source: Added a note to the Property Observers section about property observers being called when you pass a property as an in-out parameter.
ja: ある注意をプロパティオブザーバー節に加えました、あなたがあるプロパティをin-outパラメータとして渡すとき呼び出されているプロパティオブザーバーについて。

source: Added a note to the Rethrowing Functions and Methods section that rethrowing functions can’t directly throw errors.
ja: ある注意を再スローを行う関数とメソッド節に加えた、それは再スロー関数が直接にエラーをスローできないことです。

source: Added a note to the Type Casting for Any and AnyObject section about using an optional value when a value of type Any is expected.
ja: ひとつの注をAnyおよびAnyObjectに対する型キャストの節へ型Anyの値が期待される時にオプショナル値を使うことについて加えた。

source: Added a note to the Weak References section about the differences in weak references between garbage collected systems and ARC.
ja: 節弱い参照にガベージコレクトシステムとARCとの間の弱い参照における違いについての情報の注意書きを加えた。

source: Added a note to the Weak References section about weak references being unsuitable for caching.
ja: キャッシュするのにふさわしくない弱い参照についての注を弱い参照節に加えた。

source: Added a section about error handling to the A Swift Tour chapter.
ja: エラー処理についての節をスウィフトツアー章に加えた。

source: Added an example of Extending a Generic Type.
ja: 総称体型を拡張するの例を加えました。

source: Added an example of failable numeric conversions to the Failable Initializers section.
ja: 失敗できる数値変換の例を、失敗できるイニシャライザの節に加えた。

source: Added an example of using multiple optional bindings with a where clause to the Optional Binding section.
ja: 複数のオプショナル束縛をwhere節とともに使う例をオプショナルの束縛節に加えた。

source: Added an example that uses the ?? operator to the A Swift Tour chapter.
ja: ??演算子を使う例をスウィフトツアー節に加えた。

source: Added examples of iterating over a range to the For-In Loops section.
ja: ある範囲のすべてにわたって反復する例をfor-inループの節に加えた。

source: Added information about #dsohandle to the Literal Expression section.
ja: #dsohandleについての情報をリテラル式の節に加えた。

source: Added information about #error and #warning to the Compile-Time Diagnostic Statement section.
ja: #errorと#warningについての情報をコンパイル時診断文の節に加えた。

source: Added information about API availability checking to the Checking API Availability section of the Control Flow chapter and the Availability Condition section of the Statements chapter.
ja: API有効性確認についての情報を節API有効性の確認に章制御の流れで、そして節有効性条件に章文で追加した。

source: Added information about access control for unit testing to the Access Levels for Unit Test Targets section of the Access Control chapter.
ja: ユニットテストのためのアクセス制御についての情報をユニットテストターゲットのためのアクセス水準の節にアクセス制御の章で追加した。

source: Added information about accessing all of an enumeration’s cases to the Iterating over Enumeration Cases section.
ja: 列挙の持つケース節の全てにアクセスすることについての情報を列挙ケース節の全てにわたって反復するの節に加えた。

source: Added information about accessing the selector of an Objective-C property’s getter or setter to the Selector Expression section.
ja: Objective-Cプロパティのゲッターやセッターのセレクタにアクセスすることについての情報をセレクタ式の節に加えた。

source: Added information about build configuration and line control statements to the Compiler Control Statements section.
ja: ビルド設定および行制御文についての情報をコンパイラ制御文節に加えた。

source: Added information about comparing tuples to the Comparison Operators section.
ja: タプルの比較についての情報を比較演算子節に加えた。

source: Added information about conditional protocol conformance to the Extension Declaration section of the Declarations chapter, and to the Conditionally Conforming to a Protocol section of the Protocols chapter.
ja: 条件プロトコル準拠についての情報を拡張宣言の節に宣言章で、そしてあるプロトコルに条件付きで準拠するの節にプロトコル章で加えた。

source: Added information about dynamic members that are looked up by key path at runtime to the dynamicMemberLookup section.
ja: 実行時にキーパスによって検索される動的メンバーについての情報をdynamicMemberLookupの節に加えました。

source: Added information about error handling to the Error Handling chapter, the Do Statement section, the Throw Statement section, the Defer Statement section, and the Try Operator section.
ja: エラー処理についての情報を章エラー処理、節do文、節throw文、節defer文、そして節try演算子に追加した。

source: Added information about exclusive access to memory to the Memory Safety chapter.
ja: メモリに対する排他アクセスについての情報をメモリ安全の章に加えた。

source: Added information about explicitly referencing an initializer to the Initializer Expression section.
ja: 明示的にあるイニシャライザを参照することについての情報をイニシャライザ式節に加えた。

source: Added information about functions that specify a protocol that their return value conforms to, instead of providing a specific named return type, to the Opaque Types chapter.
ja: ある指定された名前付き戻り型を提供する代わりに、それらの戻り値が準拠するあるプロトコルを指定する関数それらについての情報を不透明型の章へ加えました。

source: Added information about how to conditionally compile code depending on the Swift compiler version being used to the Conditional Compilation Block section.
ja: 使われているスウィフトコンパイラバージョンに基づいて条件付きでコードをコンパイルする方法についての情報を条件コンパイルブロックの節に加えた。

source: Added information about how to conditionally compile code depending on the version of Swift being used to the Conditional Compilation Block section.
ja: 使われているスウィフトのバージョンに基づいて条件付きでコードをコンパイルする方法についての情報を条件コンパイルブロック節に加えた。

source: Added information about how to distinguish between methods or initializers whose names differ only by the names of their arguments to the Explicit Member Expression section.
ja: それらの名前がそれらの引数の名前でだけ異なるところのメソッド間またはイニシャライザ間で区別をする方法についての情報を明示的メンバー式節に加えた。

source: Added information about how type inference works with Literals.
ja: 型推論がリテラルで働く方法についての情報を加えました。

source: Added information about inlining to the Declaration Attributes section under the inlinable and usableFromInline attributes.
ja: インラインについての情報を宣言属性の節にinlinableとusableFromInline属性の下で加えた。

source: Added information about members that are looked up by name at runtime to the Declaration Attributes section under the dynamicMemberLookup attribute.
ja: 実行時に名前によって捜されるメンバについての情報を宣言属性の節にdynamicMemberLookup属性の下で加えた。

source: Added information about multiline string literals to the String Literals section of the Strings and Characters chapter, and to the String Literals section of the Lexical Structure chapter.
ja: 複数行文字列リテラルについての情報を文字列リテラルの節へ文字列と文字の章で、そして文字列リテラルの節へ語彙の構造の章で加えた。

source: Added information about operator precedence groups to the Precedence for Custom Infix Operators section of the Advanced Operators chapter, and to the Precedence Group Declaration section of the Declarations chapter.
ja: 演算子優先順位グループについての情報をあつらえの演算子に対する優先順位の節に先進の演算子の章で、そして優先順位グループ定義の節に宣言の章で加えた。

source: Added information about passing a key path instead of a closure to the Key-Path Expression section.
ja: キーパスをクロージャの代わりに渡すことについての情報をキーパス式の節に加えた。

source: Added information about playground literals to the Literal Expression section.
ja: プレイグラウンドリテラルについての情報をリテラル式の節に加えた。

source: Added information about preconditions and fatal errors to the Assertions and Preconditions section.
ja: 前提条件と致命的なエラーについての情報を表明と前提条件の節に加えた。

source: Added information about property wrappers to the Property Wrappers section.
ja: プロパティラッパーについての情報をプロパティラッパーの節に加えました。

source: Added information about protocol extensions to the Protocol Extensions section of the Protocols chapter.
ja: プロトコル拡張についての情報をプロトコル拡張の節にプロトコルの章で追加した。

source: Added information about recursive enumerations to the Recursive Enumerations section of the Enumerations chapter and the Enumerations with Cases of Any Type section of the Declarations chapter.
ja: 再帰列挙についての情報を再帰列挙節に列挙章で、そして随意の型のケース節をもつ列挙節に宣言章で加えた。

source: Added information about recursive protocol constraints to the Using a Protocol in Its Associated Type’s Constraints section.
ja: 再帰的プロトコル制約についての情報をあるプロトコルをその関連型のもつ制約において使用するの節に加えた。

source: Added information about switch cases that have multiple patterns to the Switch section of the Control Flow chapter and the Switch Statement section of the Statements chapter.
ja: 複数のパターンを持つスイッチケース節についての情報を、節スイッチに章制御の流れで、そして節スイッチ文に章文で加えた。

source: Added information about synthesized implementations of equivalence operators to the Equivalence Operators section.
ja: 等価演算子の合成実装についての情報を等価演算子の節に加えた。

source: Added information about the #selector syntax for Objective-C selectors to the Selector Expression section.
ja: Objective-Cセレクタのための#selector構文についての情報をセレクタ式節に加えた。

source: Added information about the @GKInspectable attribute to the Declaration Attributes section.
ja: @GKInspectable属性についての情報を宣言属性節に加えました。
